# Ultralytics YOLOv8s-seg with Dual-Purpose P2 Head (Fixed Conv Syntax)
nc: 80
depth_multiple: 0.33
width_multiple: 0.5

backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9

head:
  # Standard FPN path
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2f, [512]] # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f, [256]] # 15 (P3/8)

  # P2 Head
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 16
  - [[-1, 1], 1, Concat, [1]]                    # 17
  - [-1, 1, Conv, [96, 1, 1]]                    # 18 (reduce a bit)

# Branch 1: Small Object (lighter, sharper)
  - [-1, 1, Conv, [48, 3, 1]]                    # 19
  - [-1, 2, C2f, [48]]                           # 20
  - [-1, 1, Conv, [48, 3, 1]]                    # 21

# Branch 2: Transparent (better diversity)
  - [-1, 1, Conv, [48, 3, 1]]                    # 22

# multi-scale receptive fields
  - [-1, 1, Conv, [48, 3, 1, 2, 1, 2]]           # 23 (dilation=2)
  - [-1, 1, Conv, [48, 5, 1, 2]]                 # 24 (larger kernel instead of dilation=3)
  - [[22, 23, 24], 1, Concat, [1]]               # 25
# better fusion
  - [-1, 1, Conv, [64, 1, 1]]                    # 26
  - [-1, 1, CBAM, [64]]                          # 27
  - [-1, 1, Conv, [64, 3, 1]]                    # 28

# Fuse branches (controlled)
  - [[21, 28], 1, Concat, [1]]                   # 29
  - [-1, 1, Conv, [96, 1, 1]]                    # 30 (reduce mixing)
  - [-1, 2, C2f, [96]]                           # 31 (lighter refinement)
  
  # Continue FPN
  - [15, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]                          # 35

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 3, C2f, [1024]]                         # 38

  # Segment head
  - [[15, 32, 34, 37], 1, Segment, [nc, 32, 256]]

ch: 4