# Ultralytics YOLOv8s-seg with Dual-Purpose P2 Head (CBAM + Channel-Divisible)
nc: 80
depth_multiple: 0.33
width_multiple: 0.5

backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9

head:
  # Standard FPN path
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2f, [512]] # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f, [256]] # 15 (P3/8)

  # P2 Head
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 16
  - [[-1, 1], 1, Concat, [1]]                    # 17: 128+256=384
  - [-1, 1, Conv, [128, 1, 1]]                   # 18: 384→128
  
  # Branch 1: Small Object Detection
  - [-1, 1, Conv, [64, 3, 1]]                    # 19: 128→64
  - [-1, 3, C2f, [64]]                           # 20: 64→64
  - [-1, 1, Conv, [64, 3, 1]]                    # 21: 64→64
  
  # Branch 2: Transparent Object Detection with CBAM
  - [-1, 1, Conv, [64, 3, 1]]                    # 22: 128→64
  - [-1, 1, Conv, [64, 3, 1, 1, 2]]              # 23: 64→64
  - [-1, 1, Conv, [64, 3, 1, 1, 3]]              # 24: 64→64
  - [[22, 23, 24], 1, Concat, [1]]               # 25: 192
  - [-1, 1, Conv, [64, 1, 1]]                    # 26: 192→64
  - [-1, 1, CBAM, [64]]                          # 27: CBAM with 64 channels ✓
  #- [-1, 1, Conv, [64, 3, 1]]                    # 28: 64→64
  
  # Fuse both branches
  - [[21, 28], 1, Concat, [1]]                   # 29: 64+64=128
  - [-1, 1, Conv, [128, 1, 1]]                   # 30: 128→128
  - [-1, 3, C2f, [128]]                          # 31: 128→128 ✓
  - [-1, 3, C2f, [128]]                          # 32: 128→128 ✓ (P2 output)
  
  # Continue FPN
  - [15, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]                          # 35

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 3, C2f, [1024]]                         # 38

  # Segment head with updated indices
  - [[15, 32, 35, 38], 1, Segment, [nc, 32, 256]]

ch: 4