# Ultralytics YOLOv8s-seg custom with P2 head - Lightweight Dual Branch
nc: 80
depth_multiple: 0.33
width_multiple: 0.5

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9

head:
  # Standard FPN
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2f, [512]] # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f, [256]] # 15 (P3)

  # -----------------------------
  # 🔹 LIGHTWEIGHT DUAL-BRANCH P2
  # -----------------------------

  # Upsample to P2
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 16
  - [[-1, 1], 1, Concat, [1]]                    # 17
  - [-1, 1, Conv, [128, 1, 1]]                   # 18 (align)

  # ──────────────────────────────────────────────
  # BRANCH A: Small Object (light)
  # ──────────────────────────────────────────────
  - [18, 1, Conv, [128, 3, 1]]                   # 19
  - [-1, 1, Conv, [128, 3, 1]]                   # 20
  - [-1, 1, nn.MaxPool2d, [3, 1, 1]]             # 21
  - [[-2, -1], 1, Concat, [1]]                   # 22 (256ch)
  - [-1, 1, Conv, [128, 1, 1]]                   # 23 (compress back)

  # ──────────────────────────────────────────────
  # BRANCH B: Edge Detection (ultra-light)
  # ──────────────────────────────────────────────
  - [18, 1, Conv, [64, 3, 1]]                    # 24
  - [-1, 1, Conv, [64, 5, 1]]                    # 25 (large kernel edge)
  - [-1, 1, Conv, [64, 3, 1]]                    # 26
  - [[24, 26], 1, Concat, [1]]                   # 27 (128ch)

  # ──────────────────────────────────────────────
  # FUSE (minimal)
  # ──────────────────────────────────────────────
  - [[23, 27], 1, Concat, [1]]                   # 28 (256ch)
  - [-1, 1, Conv, [128, 1, 1]]                   # 29 (final P2)

  # -----------------------------
  # 🔹 Continue pyramid
  # -----------------------------

  # P2 → P3
  - [29, 1, Conv, [256, 3, 2]]                   # 30
  - [[-1, 15], 1, Concat, [1]]                   # 31
  - [-1, 3, C2f, [256]]                          # 32 (refined P3)

  # P4
  - [32, 1, Conv, [256, 3, 2]]                   # 33
  - [[-1, 12], 1, Concat, [1]]                   # 34
  - [-1, 3, C2f, [512]]                          # 35

  # P5
  - [-1, 1, Conv, [512, 3, 2]]                   # 36
  - [[-1, 9], 1, Concat, [1]]                    # 37
  - [-1, 3, C2f, [1024]]                         # 38

  # Segment head
  - [[32, 29, 35, 38], 1, Segment, [nc, 32, 256]]

# number of feature maps fed to segment head
ch: 4