# Ultralytics YOLOv8s-seg custom with P2 head
nc: 80
depth_multiple: 0.33
width_multiple: 0.5

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [512]] # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 15 (P3/8-small)

  # P2 small-object head: upsample P3 -> P2
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # upsample P3 → 160x160
  - [[-1, 1, 2], 1, Concat, [1]]
  - [-1, 3, C2f, [128]]
  - [-1, 3, C2f, [128]]                   # 19 (P2 head)

  - [15, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]] # 22 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2f, [1024]] # 25 (P5/32-large)

  # Segment head with 4 inputs: P2, P3, P4, P5
  - [[ 15, 19, 22, 25], 1, Segment, [nc, 32, 256]]

# number of feature maps fed to segment head
ch: 4