# YOLOE-v8-seg with CBAM on P3 only

nc: 80

backbone:
  - [-1, 1, Conv, [64, 3, 2]]      # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]     # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]     # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]     # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]    # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]       # 9

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]      # P4
  - [-1, 3, C2f, [512]]            # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]      # P3
  - [-1, 3, C2f, [256]]            # 15 (P3 output)

  # ✅ ONLY CHANGE HERE
  - [-1, 1, CBAM, [256]]           # 16 (P3 attention boost)

  - [16, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]     # P4 head path
  - [-1, 3, C2f, [512]]            # 18

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]      # P5 head path
  - [-1, 3, C2f, [1024]]           # 21

  # unchanged head input structure
  - [[15, 18, 21], 1, YOLOESegment, [nc, 32, 256, 512, True]]