# Ultralytics YOLOv8s-seg with Dual-Purpose P2 Head (Fixed Conv Syntax)
nc: 80
depth_multiple: 0.33
width_multiple: 0.5

backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9

head:
  # Standard FPN path
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2f, [512]] # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f, [256]] # 15 (P3/8)

  # P2 Head
    # P2 Head (optimized: small + transparent)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 16
  - [[-1, 1], 1, Concat, [1]]                    # 17
  - [-1, 1, Conv, [128, 1, 1]]                   # 18 (stronger base)

  # Edge + texture preservation (LIGHT, effective)
  - [-1, 1, Conv, [128, 3, 1]]                   # 19
  - [-1, 2, C2f, [128]]                          # 20

  # Controlled receptive field expansion (transparent objects)
  - [-1, 1, Conv, [128, 3, 1, 2, 1, 2]]          # 21 (dilation=2, correct padding)

  # Final refinement (IMPORTANT: keep strong channels)
  - [-1, 2, C2f, [128]]                          # 22
  
  # Continue FPN
  - [15, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]                          # 35

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 3, C2f, [1024]]                         # 38

  # Segment head
  - [[15, 22, 25, 28], 1, Segment, [nc, 32, 256]]

ch: 4